; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v10 ?v12)
             (pred_9 ?v6 ?v8)
             (pred_7 ?v10 ?v8)
             (pred_10 ?v2 ?v10 )
	     (pred_1 ?v10)
             (pred_8 ?v11)
             (pred_6 ?v6)
             (pred_3 ?v8)
             (pred_5 ?v10)
             (pred_11 ?v6)
             (pred_12 ?v10)
             (pred_2 ))



(:action op_4
:parameters (?v1 ?v5 ?v7 ?v3)
:precondition (and (pred_8 ?v1) (pred_8 ?v5) (pred_6 ?v7) (pred_3 ?v3)
          (pred_4 ?v1 ?v5) (pred_9 ?v7 ?v3)
                   (pred_7 ?v5 ?v3) (pred_1 ?v1) 
                   (pred_5 ?v5) (pred_11 ?v7))
:effect (and  (pred_12 ?v5) (not (pred_5 ?v5))))


(:action op_2
:parameters (?v1 ?v13)
:precondition (and (pred_8 ?v1) (pred_8 ?v13)
               (pred_1 ?v1) (pred_4 ?v1 ?v13) (pred_12 ?v13))
:effect (and (pred_1 ?v13) (not (pred_1 ?v1))))

(:action op_1
:parameters (?v1 ?v7)
:precondition (and (pred_8 ?v1) (pred_6 ?v7) 
                  (pred_1 ?v1) (pred_10 ?v7 ?v1) (pred_2 ))
:effect (and (pred_11 ?v7)
   (not (pred_10 ?v7 ?v1)) (not (pred_2 ))))


(:action op_5
:parameters (?v1 ?v4 ?v9)
:precondition (and (pred_8 ?v1) (pred_6 ?v4) (pred_6 ?v9)
                  (pred_1 ?v1) (pred_11 ?v9) (pred_10 ?v4 ?v1))
:effect (and (pred_11 ?v4) (pred_10 ?v9 ?v1)
        (not (pred_11 ?v9)) (not (pred_10 ?v4 ?v1))))

(:action op_3
:parameters (?v1 ?v7)
:precondition (and (pred_8 ?v1) (pred_6 ?v7) 
                  (pred_1 ?v1) (pred_11 ?v7))
:effect (and (pred_2 ) (pred_10 ?v7 ?v1) (not (pred_11 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_14 obj_10 obj_23 obj_22 obj_07 obj_06 obj_12 obj_25 obj_30 obj_26 obj_08 obj_09 obj_27 obj_21 obj_18 obj_01 obj_13 obj_20 obj_04 obj_17 obj_31 obj_05 obj_28 obj_24
    obj_02 obj_16 obj_03
    obj_11 obj_15 obj_29
    )

    (:init
       (pred_2)

       (pred_8 obj_19)
       (pred_8 obj_14)
       (pred_8 obj_10)
       (pred_8 obj_23)
       (pred_8 obj_22)
       (pred_8 obj_07)
       (pred_8 obj_06)
       (pred_8 obj_12)
       (pred_8 obj_25)
       (pred_8 obj_30)
       (pred_8 obj_26)
       (pred_8 obj_08)
       (pred_8 obj_09)
       (pred_8 obj_27)
       (pred_8 obj_21)
       (pred_8 obj_18)
       (pred_8 obj_01)
       (pred_8 obj_13)
       (pred_8 obj_20)
       (pred_8 obj_04)
       (pred_8 obj_17)
       (pred_8 obj_31)
       (pred_8 obj_05)
       (pred_8 obj_28)
       (pred_8 obj_24)
       (pred_3 obj_02)
       (pred_3 obj_16)
       (pred_3 obj_03)
       (pred_6 obj_11)
       (pred_6 obj_15)
       (pred_6 obj_29)

       (pred_4 obj_19 obj_07)
       (pred_4 obj_19 obj_14)
       (pred_4 obj_14 obj_06)
       (pred_4 obj_14 obj_10)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_10 obj_12)
       (pred_4 obj_10 obj_23)
       (pred_4 obj_10 obj_14)
       (pred_4 obj_23 obj_25)
       (pred_4 obj_23 obj_22)
       (pred_4 obj_23 obj_10)
       (pred_4 obj_22 obj_30)
       (pred_4 obj_22 obj_23)
       (pred_4 obj_07 obj_26)
       (pred_4 obj_07 obj_06)
       (pred_4 obj_07 obj_19)
       (pred_4 obj_06 obj_08)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_06 obj_14)
       (pred_4 obj_06 obj_07)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_12 obj_25)
       (pred_4 obj_12 obj_10)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_25 obj_27)
       (pred_4 obj_25 obj_30)
       (pred_4 obj_25 obj_23)
       (pred_4 obj_25 obj_12)
       (pred_4 obj_30 obj_21)
       (pred_4 obj_30 obj_22)
       (pred_4 obj_30 obj_25)
       (pred_4 obj_26 obj_18)
       (pred_4 obj_26 obj_08)
       (pred_4 obj_26 obj_07)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_08 obj_06)
       (pred_4 obj_08 obj_26)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_09 obj_27)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_09 obj_08)
       (pred_4 obj_27 obj_20)
       (pred_4 obj_27 obj_21)
       (pred_4 obj_27 obj_25)
       (pred_4 obj_27 obj_09)
       (pred_4 obj_21 obj_04)
       (pred_4 obj_21 obj_30)
       (pred_4 obj_21 obj_27)
       (pred_4 obj_18 obj_17)
       (pred_4 obj_18 obj_01)
       (pred_4 obj_18 obj_26)
       (pred_4 obj_01 obj_31)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_18)
       (pred_4 obj_13 obj_05)
       (pred_4 obj_13 obj_20)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_20 obj_28)
       (pred_4 obj_20 obj_04)
       (pred_4 obj_20 obj_27)
       (pred_4 obj_20 obj_13)
       (pred_4 obj_04 obj_24)
       (pred_4 obj_04 obj_21)
       (pred_4 obj_04 obj_20)
       (pred_4 obj_17 obj_31)
       (pred_4 obj_17 obj_18)
       (pred_4 obj_31 obj_05)
       (pred_4 obj_31 obj_01)
       (pred_4 obj_31 obj_17)
       (pred_4 obj_05 obj_28)
       (pred_4 obj_05 obj_13)
       (pred_4 obj_05 obj_31)
       (pred_4 obj_28 obj_24)
       (pred_4 obj_28 obj_20)
       (pred_4 obj_28 obj_05)
       (pred_4 obj_24 obj_04)
       (pred_4 obj_24 obj_28)
       (pred_5 obj_25)
       (pred_5 obj_09)
       (pred_5 obj_17)
       (pred_7  obj_25 obj_02)
       (pred_7  obj_09 obj_16)
       (pred_7  obj_17 obj_03)
       (pred_12 obj_19)
       (pred_12 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_23)
       (pred_12 obj_22)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_12)
       (pred_12 obj_30)
       (pred_12 obj_26)
       (pred_12 obj_08)
       (pred_12 obj_27)
       (pred_12 obj_21)
       (pred_12 obj_18)
       (pred_12 obj_01)
       (pred_12 obj_13)
       (pred_12 obj_20)
       (pred_12 obj_04)
       (pred_12 obj_31)
       (pred_12 obj_05)
       (pred_12 obj_28)
       (pred_12 obj_24)

       (pred_9  obj_11 obj_02)
       (pred_9  obj_15 obj_16)
       (pred_9  obj_29 obj_03)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_29 obj_07)
       (pred_1 obj_22)
    )

    (:goal (and
       (pred_10 obj_11 obj_26)
       (pred_10 obj_15 obj_04)
    ))
(:constraints
  (always (not (pred_1 obj_21)))
)
)

; plan
1. (op_2 obj_22 obj_23)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_23)
   goals met: 0 of 2
2. (op_2 obj_23 obj_10)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_10)
   goals met: 0 of 2
3. (op_2 obj_10 obj_14)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_14)
   goals met: 0 of 2
4. (op_2 obj_14 obj_06)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_06)
   goals met: 0 of 2
5. (op_2 obj_06 obj_08)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_08)
   goals met: 0 of 2
6. (op_2 obj_08 obj_26)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_26)
   goals met: 0 of 2
7. (op_2 obj_26 obj_07)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_07)
   goals met: 0 of 2
8. (op_2 obj_07 obj_19)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_19)
   goals met: 0 of 2
9. (op_1 obj_19 obj_15)
   deleted: (pred_10 obj_15 obj_19) (pred_2)
   added: (pred_11 obj_15)
   goals met: 0 of 2
10. (op_2 obj_19 obj_07)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_07)
   goals met: 0 of 2
11. (op_2 obj_07 obj_26)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_26)
   goals met: 0 of 2
12. (op_2 obj_26 obj_08)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_08)
   goals met: 0 of 2
13. (op_2 obj_08 obj_01)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_01)
   goals met: 0 of 2
14. (op_2 obj_01 obj_13)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_13)
   goals met: 0 of 2
15. (op_2 obj_13 obj_20)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_20)
   goals met: 0 of 2
16. (op_2 obj_20 obj_04)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_04)
   goals met: 0 of 2
17. (op_3 obj_04 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_2) (pred_10 obj_15 obj_04)
   goals met: 1 of 2
18. (op_2 obj_04 obj_20)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_20)
   goals met: 1 of 2
19. (op_2 obj_20 obj_13)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_13)
   goals met: 1 of 2
20. (op_2 obj_13 obj_01)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_01)
   goals met: 1 of 2
21. (op_2 obj_01 obj_08)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_08)
   goals met: 1 of 2
22. (op_2 obj_08 obj_06)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_06)
   goals met: 1 of 2
23. (op_1 obj_06 obj_11)
   deleted: (pred_10 obj_11 obj_06) (pred_2)
   added: (pred_11 obj_11)
   goals met: 1 of 2
24. (op_2 obj_06 obj_07)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_07)
   goals met: 1 of 2
25. (op_2 obj_07 obj_26)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_26)
   goals met: 1 of 2
26. (op_3 obj_26 obj_11)
   deleted: (pred_11 obj_11)
   added: (pred_2) (pred_10 obj_11 obj_26)
   goals met: 2 of 2
